## merge
- 키 변수를 기준으로 두 개의 데이터 프레임을 병합하는 함수
  - left :통합데이터 프레임1
  - right: 통합 대상 데이터 프레임2
  - on : 통합 기준 key변수 및 변수 리스트(입력을 하지 않으면, 이름이 같은 변수를 key로 식별함)
  - left_on : 데이터 프레임1의 key 변수 및 변수 리스트
  - right_on : 데이터 프레임 2의 key 변수 및 변수 리스트
  - left_index : 데이터 프레임1의 인덱스를 key 변수로 사용할 지 여부
  - right_index : 데이터 프레임 2의 인덱스를 ket변수로 사용할 지 여부

In [1]:
import os
import pandas as pd
os.chdir(r'C:\Users\신상훈\Desktop\preprocessing\part-1.-데이터-핸들링\1. 데이터 핸들링\데이터')

In [6]:
os.getcwd()

'C:\\Users\\신상훈\\Desktop\\preprocessing\\part-1.-데이터-핸들링\\1. 데이터 핸들링\\데이터'

#### merge 기초

In [11]:
# Tip. OSError: Initializing from file failed가 발생하면 engine = "python"을 설정하면 피할 수 있음 (단, 속도 저하 문제가 있음)
df1 = pd.read_csv('merge_실습_employee_group.csv',engine = 'python')
df2 = pd.read_csv('merge_실습_employee_hire_date.csv',engine = 'python')

In [12]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [13]:
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [14]:
merge_df = pd.merge(df1,df2) # 컬럼명이 같아서 키를 employee로 인식함
merge_df

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

#### on을 사용하는 경우

In [15]:
merged_df = pd.merge(df1, df2, on = ["employee"])
merged_df.head()

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

#### left_on, right_on을 사용한 데이터 통합

In [16]:
df1 = pd.read_csv("merge_실습_employee_group.csv", engine = "python")
df2 = pd.read_csv("merge_실습_name_hire_date.csv", engine = "python")

In [17]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [18]:
df2

   hire_date  name
0       2004  Lisa
1       2008   Bob
2       2012  Jake
3       2014   Sue

In [19]:
# 컬럼명을 바꿔도 똑같이 작동함
merged_df = pd.merge(df1, df2, left_on = "employee", right_on = "name")
merged_df.head() # employee와 name 모두 살아 있어서, 하나를 제거해줘야 함

  employee        group  hire_date  name
0      Bob   Accounting       2008   Bob
1     Jake  Engineering       2012  Jake
2     Lisa  Engineering       2004  Lisa
3      Sue           HR       2014   Sue

In [20]:
merged_df.drop('name', axis = 1, inplace = True)
merged_df.head()

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

#### index를 사용한 데이터 통합

In [21]:
df1 = pd.read_csv("merge_실습_employee_group.csv", engine = "python")
df2 = pd.read_csv("merge_실습_name_hire_date.csv", engine = "python", index_col = "name")

In [22]:
df2.head()

      hire_date
name
Lisa       2004
Bob        2008
Jake       2012
Sue        2014

In [25]:
merged_df = pd.merge(df1, df2, left_on = "employee", right_index = True) # 왼쪽은 employee를 key로 오른쪽은 인덱스를 key로

In [26]:
merged_df.head()

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014